---
kind: type
id: T:Autodesk.Revit.DB.Electrical.InsulationTypeSetIterator
source: html/174aa468-68cd-64f7-bd6d-39a98501633c.htm
---
# Autodesk.Revit.DB.Electrical.InsulationTypeSetIterator

An iterator to a insulation type set.

## Syntax (C#)
```csharp
public abstract class InsulationTypeSetIterator : APIObject,
	IEnumerator
```